'''
Задание 3
Напишите программу, вычисляющую площадь ромба. 
Пользователь с клавиатуры вводит длину двух его диагоналей.
'''



a = float(input('Enter the lentgth of the diagonal A: '))
b = float(input('Enter the lentgth of the diagonal B: '))

square = (a * b) / 2

print('Square of the rhombus is ', format(square, '.2f'))



