'''
Задание 4
Выведите на экран надпись To be or not to be на разных строках. 
Пример вывода:To be or not to be
'''


from colorama import init

init()

print('\t\t\t\t\t\t\t\033[3mTo be') #  cmd не поддерживает italic или я что-то делаю не так
print('\t\t\t\t\t\t\tor not')
print('\t\t\t\t\t\t\tto be')



