'''
Задание 5
Выведите на экран надпись «Life is what happens 
when you're busy making other plans» John Lennon на разных строках. 
'''
    
print('"Life is what happens')
print('\twhen')
print('\t    you\'re busy making other plans"')
print('\t\t\t\t\tJohn Lennon.')



